convertigo-templates/lib_Salesforce/soap-templates/SoapBinding/CgetUpdated.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com">
   <soapenv:Header>
      <urn:CallOptions>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:client>$(HEADER_CALLOPTIONS_CLIENT)</urn:client>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:defaultNamespace>$(HEADER_CALLOPTIONS_DEFAULTNAMESPACE)</urn:defaultNamespace>
      </urn:CallOptions>
      <urn:SessionHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:sessionId>$(HEADER_SESSIONHEADER_SESSIONID)</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:getUpdated>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:sObjectType>$(BODY_GETUPDATED_SOBJECTTYPE)</urn:sObjectType>
         <!--type: {http://www.w3.org/2001/XMLSchema}dateTime-->
         <urn:startDate>$(BODY_GETUPDATED_STARTDATE)</urn:startDate>
         <!--type: {http://www.w3.org/2001/XMLSchema}dateTime-->
         <urn:endDate>$(BODY_GETUPDATED_ENDDATE)</urn:endDate>
      </urn:getUpdated>
   </soapenv:Body>
</soapenv:Envelope>